[
    {
        "id": "67dfce82-02d6-4cf2-815c-200d5dcc295a",
        "term": "Веб-интерфейс",
        "description": "Веб-страница или совокупность веб-страниц, предоставляющая пользовательский интерфейс для взаимодействия с сервисом или устройством посредством протокола HTTP и веб-браузера. Веб-интерфейсы получили широкое распространение в связи с ростом популярности всемирной паутины и соответственно — повсеместного распространения веб-браузеров."
    },
    {
        "id": "67df2e82-02d6-4cf2-815c-200d5dcc295a",
        "term": "Адаптивная верстка",
        "description": "Это такой способ создания веб-страниц, при котором они автоматически подстраиваются под размеры и ориентацию экрана устройства, а их дизайн варьируется в зависимости от действий пользователя."
    },
    {
        "id": "67dfc282-02d6-4cf2-815c-200d5dcc295a",
        "term": "Резиновая верстка (Elastic layout)",
        "description": "Это когда вы задаёте всему макету и отдельным его частям не фиксированную ширину, а эластичную — в процентах. За исключением минимальной и максимальной ширины. Высоту в вебе в принципе не принято задавать — обычно она подстраивается под содержимое."
    },
    {
        "id": "67dfce82-0226-4cf2-815c-200d5dcc295a",
        "term": "Адаптивная верстка (Adaptive layout) ",
        "description": "Позволяет подстраиваться основному контейнеру и любому другому элементу сайта под разрешение экрана, делая возможным менять размер шрифта, расположение объектов, цвет и т. д. Происходит это динамически, например, с использованием медиа-запросов (@media), позволяющих автоматически определять разрешение монитора, тип устройства и подставлять указанные значения в автоматическом режиме."
    },
    {
        "id": "67dfce82-02d6-2cf2-815c-200d5dcc295a",
        "term": "Отзывчивая верстка (Responsive layout)",
        "description": "Это объединение резиновой и адаптивной вёрстки. При данном подходе используются как медиа-запросы, так и процентное задание ширины компонентов."
    },
    {
        "id": "67dfce82-02d6-4cf2-215c-200d5dcc295a",
        "term": "Подход",
        "description": "Совокупность приёмов, способов в воздействии на кого-нибудь, в изучении чего-нибудь, пробуждении к чему-нибудь."
    },
    {
        "id": "67dfce82-02d6-4cf2-8p2c-200d5dcc295a",
        "term": "Сравнительный анализ",
        "description": "Один из самых популярных и основополагающих методов анализа, предполагающий выявление определенных характеристик у объекта исследования и сравнение его по этим параметрам с другими объектами или с самим собой, но, например, в разные периоды времени."
    },
    {
        "id": "67dfce82-02d6-4cf2-815c-200d5dcc291a",
        "term": "Медиа-запросы",
        "description": "Это функция CSS3, позволяющая адаптировать рендеринг контента к различным условиям, таким как разрешение экрана."
    },
    {
        "id": "67dfce82-02d6-4cf2-815c-200d52cc292a",
        "term": "Критерий",
        "description": "Признак, основание, правило принятия решения по оценке чего-либо на соответствие предъявленным требованиям."
    },
    {
        "id": "67dfce56-02d6-4cf2-815c-200d5dcc295a",
        "term": "Метод",
        "description": "Способ достижения какой-либо цели. В отличие от области знаний или исследований, является авторским, то есть созданным конкретной персоной или группой персон, научной или практической школой."
    },
    {
        "id": "67dfce82-02d6-4cf2-335g-200d5dcc295a",
        "term": "Веб-дизайн",
        "description": "Отрасль веб-разработки и разновидность дизайна, в задачи которой входит проектирование пользовательских веб-интерфейсов для сайтов или веб-приложений."
    },
    {
        "id": "67dfc23f-02d6-4cf2-815c-200d5dcc295a",
        "term": "Технология",
        "description": "Совокупность методов и инструментов для достижения желаемого результата; в широком смысле — применение научного знания для решения практических задач. Технология включает в себя способы работы, её режим, последовательность действий."
    },
    {
        "id": "67dfce11-02d6-4cf2-815c-200d5dcc295a",
        "term": "Фреймворк",
        "description": "Программная платформа, определяющая структуру программной системы; программное обеспечение, облегчающее разработку и объединение разных компонентов большого программного проекта."
    },
    {
        "id": "67dfce82-021m-4cf2-815c-200d5dcc295a",
        "term": "Flexbox",
        "description": "Технология позиционирования контента страницы, которая уже имеет достаточно широкую поддержку браузеров. Flexbox предоставляет инструменты для быстрого создания сложных, гибких макетов, и функции, которые были сложны в традиционных методах CSS."
    },
    {
        "id": "67dfce82-02d6-4cf2-82uc-200d5dcc295a",
        "term": "CSS Grid Layout",
        "description": "Технология позиционирования контента страницы, которая представляет двумерную сетку для CSS, которую можно использовать для размещения основных областей страницы или небольших элементов пользовательского интерфейса."
    },
    {
        "id": "67dfcee2-02d6-4cf2-815c-200d5dcc295a",
        "term": "Тестирование",
        "description": "Процесс исследования, испытания программного продукта, имеющий своей целью проверку соответствия между реальным поведением программы и её ожидаемым поведением на конечном наборе тестов, выбранных определённым образом."
    },
    {
        "id": "67dfce82-02d6-4cf2-815c-200d5dc4r95a",
        "term": "Рендер",
        "description": "Это процесс создания финального изображения или последовательности из изображений на основе двухмерных или трехмерных данных."
    }

]